# Ch 21 : 데이터 프레임 Column(열) 다루기

### DataFrame 만들기

- Pandas 라이브러리를 import 합니다
- 임의의 데이터 프레임 하나를 만듭니다.

- pandas DataFrame Document : https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html

In [1]:
import pandas as pd

In [2]:
data = {
    "c0" : [1,2,3],
    "c1" : [4,5,6]
}

In [3]:
df = pd.DataFrame(data,index=['r0','r1','r2'])

In [4]:
df

    c0  c1
r0   1   4
r1   2   5
r2   3   6

### 열 선택하기

- 열을 선택하는 방법에는 두가지가 있습니다
    1. 딕셔너리에서 key binding하는 방식으로 선택
    2. 접근연산자('.')를 사용하여 선택

In [5]:
df['c0']

r0    1
r1    2
r2    3
Name: c0, dtype: int64

In [6]:
df.c1

r0    4
r1    5
r2    6
Name: c1, dtype: int64

### 열 추가하기

- 열을 추가할때는 key binding 형식, (DataFrame)\[(추가할 Column이름)\]과 같은 형태로 추가해 주어야 합니다. Pandas에서는 접근 연산자로 열을 추가하는것을 지원하지 않으니 주의해야합니다

- 값을 하나만 대입하게 되면, 해당 열의 기본값으로 대입되게 됩니다.(ln\[9\]) 하나가 아닌 여러개를 대입할때는 열의 길이만큼 데이터를 대입해 주어야 합니다.

In [7]:
df['c2'] = 7,8,9

In [8]:
df

    c0  c1  c2
r0   1   4   7
r1   2   5   8
r2   3   6   9

In [9]:
df['c3'] = 0

In [10]:
df

    c0  c1  c2  c3
r0   1   4   7   0
r1   2   5   8   0
r2   3   6   9   0

In [11]:
df.c4 = [7,8,9]

/var/folders/bv/hfxy36vd6_5f_4959zpp0lp40000gn/T/ipykernel_1174/3267160241.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.c4 = [7,8,9]

In [12]:
#실제로 적용이 안되는것을 볼 수 있다.
df

    c0  c1  c2  c3
r0   1   4   7   0
r1   2   5   8   0
r2   3   6   9   0

In [13]:
df['c4'] = [7,8,9]

In [14]:
df

    c0  c1  c2  c3  c4
r0   1   4   7   0   7
r1   2   5   8   0   8
r2   3   6   9   0   9

### 열 변경하기

- 열을 변경할때는 접근연산자 '.'으로 선택하여, 값을 변경해 줄 수 있습니다

In [15]:
df.c3 = 10

In [16]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10   7
r1   2   5   8  10   8
r2   3   6   9  10   9

In [17]:
df['c3'] = [11,12,13]

In [18]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  11   7
r1   2   5   8  12   8
r2   3   6   9  13   9

### 열 삭제하기

- 열을 삭제하기 위해서는 DataFrame의 drop()메소드를 활용해 주어야합니다. drop()메소드를 활용할때 두개의 중요한 매개변수가 있습니다

    - axis : 해당 label을 행 혹은 열중 어디서 삭제할것인지 지정해 줍니다. 행에서 삭제하기 위해서는 0 혹은 'index'를, 열에서 삭제하기 위해서는 1 혹은 'columns'값을 넣어줍니다
    - inplace : False를 대입한 경우에는 해당 데이터 프레임에서 해당 연산을 수행한 '복사본'을 반환합니다. True를 대입한 경우에는 해당 연산을 데이터프레임에 연산결과를 적용하고 None을 반환합니다
    - drop으로 삭제할 열은 MutableSequence자료형을 통해 여러개 지정할 수 도 있습니다

In [19]:
# inplace를 False로 하면 연산이 적용된 복사본이 반환되므로 출력 결과가 있음
df.drop('c1',axis=1,inplace=False)

    c0  c2  c3  c4
r0   1   7  11   7
r1   2   8  12   8
r2   3   9  13   9

- inplace옵션을 False로 했기때문에 실제 DataFrame에 적용이 안된것을 볼 수 있습니다

In [20]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  11   7
r1   2   5   8  12   8
r2   3   6   9  13   9

In [21]:
# inplace를 True로 하면 None이 반환되므로 출력 결과가 없음
df.drop('c1',axis=1,inplace=True)

In [22]:
df

    c0  c2  c3  c4
r0   1   7  11   7
r1   2   8  12   8
r2   3   9  13   9

- 여러 열을 한번에 삭제해 봅니다.

In [23]:
df.drop(['c0','c2'],axis=1,inplace=True)

In [24]:
df

    c3  c4
r0  11   7
r1  12   8
r2  13   9